; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v1 - type_2 ?v7 - type_3)
 	      (pred_3 ?v6 - object ?v7 - type_3)
	      (pred_4 ?v1 - type_2 ?v4 - type_1)
	      (pred_1 ?v1 - type_2 ?v6 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v3 ?v8 - type_3)
       :precondition (and  (pred_2 ?v1 ?v3))
       :effect (and  (pred_2 ?v1 ?v8)
		     (not (pred_2 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_2 ?v2 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v5) (pred_2 ?v1 ?v5) (pred_4 ?v1 ?v4))
       :effect (and (pred_1 ?v1 ?v2 ?v4)
		    (not (pred_3 ?v2 ?v5)) 
		    (not (pred_4 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_2 ?v2 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v2 ?v4) (pred_2 ?v1 ?v5))
       :effect (and (pred_3 ?v2 ?v5)
		    (pred_4 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v2 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_03 - type_2
obj_08 obj_11 obj_09 obj_14 - type_1
obj_10 obj_12 obj_01 obj_04 - type_3
obj_05 obj_02 obj_13 obj_06 - object)
(:init
(pred_2 obj_07 obj_10)
(pred_4 obj_07 obj_08)
(pred_4 obj_07 obj_11)
(pred_2 obj_03 obj_04)
(pred_4 obj_03 obj_09)
(pred_4 obj_03 obj_14)
(pred_3 obj_05 obj_04)
(pred_3 obj_02 obj_10)
(pred_3 obj_13 obj_12)
(pred_3 obj_06 obj_01)
)
(:goal
(and
(pred_3 obj_05 obj_01)
(pred_3 obj_02 obj_10)
(pred_3 obj_13 obj_12)
(pred_3 obj_06 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_01)))
)
)

; plan
1. (op_1 obj_03 obj_05 obj_04 obj_14)
   deleted: (pred_3 obj_05 obj_04) (pred_4 obj_03 obj_14)
   added: (pred_1 obj_03 obj_05 obj_14)
   goals met: 2 of 4
2. (op_3 obj_07 obj_10 obj_12)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_12)
   goals met: 2 of 4
3. (op_3 obj_03 obj_04 obj_01)
   deleted: (pred_2 obj_03 obj_04)
   added: (pred_2 obj_03 obj_01)
   goals met: 2 of 4
4. (op_2 obj_03 obj_05 obj_01 obj_14)
   deleted: (pred_1 obj_03 obj_05 obj_14)
   added: (pred_3 obj_05 obj_01) (pred_4 obj_03 obj_14)
   goals met: 3 of 4
5. (op_1 obj_03 obj_06 obj_01 obj_09)
   deleted: (pred_3 obj_06 obj_01) (pred_4 obj_03 obj_09)
   added: (pred_1 obj_03 obj_06 obj_09)
   goals met: 3 of 4
6. (op_3 obj_03 obj_01 obj_12)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_12)
   goals met: 3 of 4
7. (op_2 obj_03 obj_06 obj_12 obj_09)
   deleted: (pred_1 obj_03 obj_06 obj_09)
   added: (pred_3 obj_06 obj_12) (pred_4 obj_03 obj_09)
   goals met: 4 of 4
